*** crates/landav-bound/src/base.rs:67:9: replace <impl Canonical for Base>::write_canonical with ()

*** mutation diff:
--- crates/landav-bound/src/base.rs
+++ replace <impl Canonical for Base>::write_canonical with ()
@@ -59,11 +59,11 @@
 }
 
 impl Canonical for Base {
     fn canonical_cmp(&self, other: &Self) -> core::cmp::Ordering {
         self.0.cmp(&other.0)
     }
 
     fn write_canonical(&self, out: &mut Vec<u8>) {
-        out.extend_from_slice(&self.0.to_be_bytes());
+        () /* ~ changed by cargo-mutants ~ */
     }
 }

---- canonical_order::bound_kind_satisfies_the_canonical_contract stdout ----

thread 'canonical_order::bound_kind_satisfies_the_canonical_contract' (1419442) panicked at crates/landav-bound/tests/properties/canonical_order.rs:78:13:
  left: true
 right: false

---- canonical_order::bound_satisfies_the_canonical_contract stdout ----

thread 'canonical_order::bound_satisfies_the_canonical_contract' (1419443) panicked at crates/landav-bound/tests/properties/canonical_order.rs:78:13:
  left: true
 right: false

---- canonical_order::near_miss_pairs_are_separated_by_the_canonical_bytes stdout ----
proptest: Saving this and future failures in /tmp/cargo-mutants-landav-core-8nLWJU.tmp/crates/landav-bound/tests/proptest-regressions/canonical_order.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file. (You may need to create it.)
cc caba365fbb464db043a583c07bcc4e788ad92bda2b6a66e8d90ede47916d96b7

thread 'canonical_order::near_miss_pairs_are_separated_by_the_canonical_bytes' (1419559) panicked at crates/landav-bound/tests/properties/canonical_order.rs:97:1:
Test failed: assertion failed: `(left == right)` 
  left: `true`, 
 right: `false`: BumpBase produced 3^(x0) from 2^(x0): canonical_bytes and Eq disagree at crates/landav-bound/tests/properties/canonical_order.rs:220.
minimal failing input: spec = Trans {
    log: false,
    base: 2,

failures:
    canonical_order::bound_kind_satisfies_the_canonical_contract
    canonical_order::bound_satisfies_the_canonical_contract
    canonical_order::near_miss_pairs_are_separated_by_the_canonical_bytes
    canonical_order::the_leaf_payloads_satisfy_the_canonical_contract

test result: FAILED. 109 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 17.81s

*** result: Failure(101)
