*** crates/landav-bound/src/base.rs:49:9: replace Base::get -> u32 with 0

*** mutation diff:
--- crates/landav-bound/src/base.rs
+++ replace Base::get -> u32 with 0
@@ -41,17 +41,17 @@
             return Err(BoundError::BaseTooSmall { got: k });
         }
         Ok(Self(k))
     }
 
     /// The validated base, always `>= 2`.
     #[must_use]
     pub const fn get(self) -> u32 {
-        self.0
+        0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl TryFrom<u32> for Base {
     type Error = BoundError;
 
     fn try_from(k: u32) -> Result<Self, Self::Error> {
         Self::new(k)

---- the_base_constants_agree_with_the_checked_path stdout ----

thread 'the_base_constants_agree_with_the_checked_path' (1418125) panicked at crates/landav-bound/tests/frozen_invariants.rs:84:5:
assertion `left == right` failed
  left: 0
 right: 2

---- a_validated_base_reports_the_value_it_was_validated_from stdout ----

thread 'a_validated_base_reports_the_value_it_was_validated_from' (1418119) panicked at crates/landav-bound/tests/frozen_invariants.rs:72:9:
assertion `left == right` failed: Base::new(2) must be accepted and must report 2 back
  left: Some(0)
 right: Some(2)

failures:
    a_validated_base_reports_the_value_it_was_validated_from
    the_base_constants_agree_with_the_checked_path

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
